insert into 学生 values('2016030001', '孙嘉', 21, '女', '地科学院', 4, '2016030001')
insert into 学生 values('2018010001', '周长稳', 20, '男', '计算机学院', 2, '2018010001')
insert into 学生 values('2019030002', '戴倩云', 21, '女', '地科学院', 1, '2019030002')
insert into 学生 values('2017030003', '王永红', 20, '女', '地科学院', 3, '2017030003')
insert into 学生 values('2016020001', '赵信民', 20, '女', '数学学院', 4, '2016020001')
insert into 学生 values('2017040001', '张叶', 19, '男', '马克思学院', 3, '2017040001')
insert into 学生 values('2019040002', '王路', 22, '男', '马克思学院', 1, '2019040002')
insert into 学生 values('2016010002', '李涛', 21, '男', '计算机学院', 4, '2016010002')
insert into 学生 values('2016040003', '刘从峰', 20, '男', '马克思学院', 4, '2016040003')
insert into 学生 values('2019020002', '周迎春', 22, '男', '数学学院', 1, '2019020002')
insert into 学生 values('2018010003', '于磊磊', 22, '女', '计算机学院', 2, '2018010003')
insert into 学生 values('2019050001', '杜瀛', 21, '男', '外国语学院', 1, '2019050001')


--学生申请创建社团
GO
ApplyToCreateCom '2016030001','学习社','一起学习吧'
GO
--学生查看创建社团申请信息
ShowCC '2016030001'
GO
--社团管理员批准成立 
PermitCom '学习社'
GO
--学生申请加入社团
ApplyjoinCom '2017040025','学习社','想学习'
GO
--学生查看申请加入社团记录
ShowACInfo '2017040025'
GO
--管理员批准学生加入社团
permitStu '2016030001','2017040025','学习社'
GO
--显示特定社团信息
ViewComInfo '学习社'
GO
--显示所有社团信息
viewAllComInfo 
GO




